docs/leets/2379-Minimum-Recolors-to-Get-K-Consecutive-Black-Blocks.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-03-08 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>2379. Minimum Recolors to Get K Consecutive Black Blocks</title>
<meta name="author" content="d)zharii" />
<meta name="generator" content="Org Mode" />
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<link rel="stylesheet" href="/static/t.css"/>
</head>
<body>
<nav><a href="/" tabindex="0">&larrhk; Back to Index</a></nav><div id="preamble" class="status">
Published 2025-03-08
</div>
<div id="content" class="content">
<header>
<h1 class="title">2379. Minimum Recolors to Get K Consecutive Black Blocks</h1>
<p class="subtitle" role="doc-subtitle">leetcode</p>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orga75f1de">Problem</a></li>
<li><a href="#orge777863">Solution Description</a></li>
<li><a href="#orgdcc7003">Example</a></li>
<li><a href="#orgb45919c">References</a></li>
<li><a href="#org8321f88">Solution</a></li>
</ul>
</div>
</nav>

<div id="outline-container-orga75f1de" class="outline-2">
<h2 id="orga75f1de">Problem</h2>
<div class="outline-text-2" id="text-orga75f1de">
<p>
Given a binary string, consisting of 'B' (Black) and 'W' (White) blocks, and an integer K, find the minimum number of recoloring operations to get at least K consecutive 'B' blocks. Each operation allows changing a 'W' to 'B'. Return the minimum number of such operations needed.
</p>
</div>
</div>

<div id="outline-container-orge777863" class="outline-2">
<h2 id="orge777863">Solution Description</h2>
<div class="outline-text-2" id="text-orge777863">
<p>
To implement the solution, we need to utilize a sliding window approach to keep track of a window of size K over the string. As we slide the window from the start of the string to the end, we calculate the number of 'W' blocks within the window. Our goal is to find the window with the fewest 'W' blocks, as this represents the minimum number of recolor operations needed to achieve K consecutive 'B' blocks. This approach ensures optimal performance.
</p>

<p>
The time complexity of this approach is O(N), where N is the length of the string, because we pass through the string once while maintaining the count of 'W' blocks in the window. The space complexity is O(1) since we are only storing a couple of counters and pointers.
</p>
</div>
</div>

<div id="outline-container-orgdcc7003" class="outline-2">
<h2 id="orgdcc7003">Example</h2>
<div class="outline-text-2" id="text-orgdcc7003">
<p>
Consider the binary string "WBWBBBW" with K = 3. We slide a window of size 3 across the string:
</p>
<ul class="org-ul">
<li>Window "WBW" has 2 'W', 1 'B'.</li>
<li>Window "BWB" has 1 'W', 2 'B'.</li>
<li>Window "WBB" has 1 'W', 2 'B'.</li>
<li>Window "BBB" has 0 'W', 3 'B'. (Optimal: requires 0 recolors)</li>
<li>Window "BBW" again has 1 'W', 2 'B'.</li>
</ul>

<p>
The minimum recolors required are 0, achieved by the window "BBB".
</p>
</div>
</div>

<div id="outline-container-orgb45919c" class="outline-2">
<h2 id="orgb45919c">References</h2>
<div class="outline-text-2" id="text-orgb45919c">
<p>
No specific frameworks are utilized but concepts of Sliding Window technique are used. Refer to <a href="https://en.wikipedia.org/wiki/Sliding_window_protocol">Sliding Window Protocol Wiki</a> for more information.
</p>
</div>
</div>

<div id="outline-container-org8321f88" class="outline-2">
<h2 id="org8321f88">Solution</h2>
<div class="outline-text-2" id="text-org8321f88">
<p>
<a href="https://leetcode.com/problems/minimum-recolors-to-get-k-consecutive-black-blocks/submissions/1567324105/?envType=daily-question&amp;envId=2025-03-08">2025-03-08 Minimum Recolors to Get K Consecutive Black Blocks - LeetCode</a> <code>leetcode.com</code>
</p>

<p>
The solution will follow the sliding window pattern to find the optimal window with minimal white blocks that need to be recolored.
</p>

<div class="org-src-container">
<pre class="src src-js">/**
 * Main function to find the minimum recolors needed
 * @param {string} blocks - The binary string of 'B' and 'W' characters
 * @param {number} k - Number of consecutive blacks required
 * @returns {number} - Minimum recolor operations needed
 */
function mainSolution(blocks, k) {
    const log = typeof NestedInteger !== 'undefined' ? () =&gt; {} : console.log;
    const table = typeof NestedInteger!== 'undefined' ? () =&gt; {} : console.table;

    function countBs(arr, start, end) {
        let acc = 0;
        for (let i = start; i &lt; end; i++) {
            if (arr[i] === 'B') acc += 1;
        }
        return acc;
    }

    let maxB = 0;

    for (let i = 0; i + k &lt;= blocks.length; i++) {
        const windowB = countBs(blocks, i, i + k);
        maxB = Math.max(maxB, windowB);
    }

    return k - maxB;
}

// Test cases
const testCases = [
    { blocks: "WBWBBBW", k: 3, expected: 0 },
    { blocks: "WBWBW", k: 4, expected: 2 },
    { blocks: "BBWWBBB", k: 3, expected: 0 },
    { blocks: "WWBWWB", k: 2, expected: 1 },
    { blocks: "BBBB", k: 4, expected: 0 },
];

testCases.forEach((test, index) =&gt; {
    const result = mainSolution(test.blocks, test.k);
    console.log(`Test Case ${index + 1}: ${result === test.expected ? 'Passed' : 'Failed'} (Expected: ${test.expected}, Got: ${result})`);
});
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
&copy; d)zharii. <a href="/sitemap.html">sitemap</a>
</div>
</body>
</html>
